posts/2015-01-13-the-eleventh-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Eleventh Sunday After Pentecost

I hear reports of violence and injustice,\\
and give thanks that I do not live in those places.

I see images of the hungry and ill,\\
and rejoice in my satisfaction and plenty.

My prayers are just fervent enough,\\
my compassion just tender enough,\\
my charity just generous enough,\\
my heart just cold enough.

Father,

forgive me,\\
and cleanse me of the sin\\
of being just enough.

/Amen/


#+begin_tagline
Tagged: prayer
#+end_tagline
