docs/posts/2015-01-13-the-eleventh-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 26, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Eleventh Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Eleventh Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I hear reports of violence and injustice,<br>
and give thanks that I do not live in those places.
</p>

<p>
I see images of the hungry and ill,<br>
and rejoice in my satisfaction and plenty.
</p>

<p>
My prayers are just fervent enough,<br>
my compassion just tender enough,<br>
my charity just generous enough,<br>
my heart just cold enough.
</p>

<p>
Father,
</p>

<p>
forgive me,<br>
and cleanse me of the sin<br>
of being just enough.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org4e8494c">
<p>
Tagged: prayer
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 26, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
